In [1]:
# load pandas
import pandas as pd
import seaborn as sns
import numpy as np

##### Load Data

In [20]:
smallstock_data = "http://bit.ly/smallstocks"
data = pd.read_csv(smallstock_data)
data

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

#### set index on ‘Symbol‘ and 'Date‘, allow inplace changes

In [21]:
data.set_index ('Symbol','Date',inplace=True)
data

C:\Users\ds27\AppData\Local\Temp\ipykernel_8504\1946736114.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.set_index except for the argument 'keys' will be keyword-only.
  data.set_index ('Symbol','Date',inplace=True)

              Date   Close    Volume
Symbol
CSCO    2016-10-03   31.50  14070500
AAPL    2016-10-03  112.52  21701800
MSFT    2016-10-03   57.42  19189500
AAPL    2016-10-04  113.00  29736800
MSFT    2016-10-04   57.24  20085900
CSCO    2016-10-04   31.35  18460400
MSFT    2016-10-05   57.64  16726400
CSCO    2016-10-05   31.59  11808600
AAPL    2016-10-05  113.05  21453100

####  sort indexes

In [12]:
data.sort_index()

              Date   Close    Volume
Symbol
AAPL    2016-10-03  112.52  21701800
AAPL    2016-10-04  113.00  29736800
AAPL    2016-10-05  113.05  21453100
CSCO    2016-10-03   31.50  14070500
CSCO    2016-10-04   31.35  18460400
CSCO    2016-10-05   31.59  11808600
MSFT    2016-10-03   57.42  19189500
MSFT    2016-10-04   57.24  20085900
MSFT    2016-10-05   57.64  16726400

####  Select data for “AAPL”

In [33]:
AAPL = data.loc['AAPL']
AAPL

              Date   Close    Volume
Symbol
AAPL    2016-10-03  112.52  21701800
AAPL    2016-10-04  113.00  29736800
AAPL    2016-10-05  113.05  21453100

####  Select “Close” value for “AAPL” on “2016-10-03”

In [26]:
AAPL.loc[AAPL['Date'] == '2016-10-03']

              Date   Close    Volume
Symbol
AAPL    2016-10-03  112.52  21701800

AAPL['Date'] == '2016-10-03'

#### Select data for Apple and Microsoft

In [31]:
am = data.loc[['AAPL','MSFT']]
am

              Date   Close    Volume
Symbol
AAPL    2016-10-03  112.52  21701800
AAPL    2016-10-04  113.00  29736800
AAPL    2016-10-05  113.05  21453100
MSFT    2016-10-03   57.42  19189500
MSFT    2016-10-04   57.24  20085900
MSFT    2016-10-05   57.64  16726400

#### 6) Select data for Apple and Microsoft for a particular Date

In [32]:
am.loc[am['Date'] == '2016-10-03']

              Date   Close    Volume
Symbol
AAPL    2016-10-03  112.52  21701800
MSFT    2016-10-03   57.42  19189500

#### 7) Select data for apple on multiple dates

In [42]:
data.groupby('Symbol')['Date'].value_counts()

Symbol  Date
AAPL    2016-10-03    1
        2016-10-04    1
        2016-10-05    1
CSCO    2016-10-03    1
        2016-10-04    1
        2016-10-05    1
MSFT    2016-10-03    1
        2016-10-04    1
        2016-10-05    1
Name: Date, dtype: int64

#### 8) Selecting all data for '2016-10-03','2016-10-04‘date

In [47]:
data.loc['2016-10-03':'2016-10-04']

Empty DataFrame
Columns: [Date, Close, Volume, Symbol]
Index: []

#### 9) Fetch all those rows where Volume>18000000

## Grouping and Aggregations

In [33]:
sales_data = "https://raw.githubusercontent.com/datagy/data/main/sales.csv"
data = pd.read_csv(sales_data)
data

           date  gender      region  sales
0     8/22/2022    Male  North-West  20381
1      3/5/2022    Male  North-East  14495
2      2/9/2022    Male  North-East  13510
3     6/22/2022    Male  North-East  15983
4     8/10/2022  Female  North-West  15007
..          ...     ...         ...    ...
995    6/2/2022  Female  North-West  14015
996   5/20/2022  Female  North-East  15503
997    4/2/2022    Male  North-East  18714
998   12/7/2022    Male  North-East  19910
999  12/19/2022  Female  North-West  16589

[1000 rows x 4 columns]

####  1) Load data and group by Region

In [5]:
data.groupby('region').describe()

            sales                                                        \
            count          mean          std      min      25%      50%
region
North-East  347.0  17386.072046  2032.541552  11664.0  16027.0  17414.0
North-West  322.0  15257.732919  3621.456493   6084.0  12523.0  15337.5
South       331.0  24466.864048  5253.702513  10768.0  20868.0  24492.0


                 75%      max
region
North-East  18678.00  22545.0
North-West  17703.75  26813.0
South       27908.50  43775.0

#### 2) counting number of groups

In [6]:
data.groupby('region').count()

            date  gender  sales
region
North-East   347     347    347
North-West   322     322    322
South        331     331    331

#### 3) Accessing the Groups in a GroupBy object

In [7]:
data.groupby('region').groups

{'North-East': [1, 2, 3, 12, 13, 14, 15, 18, 19, 23, 24, 25, 26, 28, 31, 35, 40, 41, 45, 50, 51, 58, 59, 60, 63, 64, 67, 68, 72, 75, 76, 77, 80, 82, 83, 85, 87, 92, 94, 100, 105, 108, 109, 112, 113, 114, 115, 120, 121, 125, 127, 130, 134, 138, 139, 140, 141, 142, 146, 149, 155, 157, 164, 165, 176, 177, 179, 180, 188, 191, 193, 195, 199, 201, 205, 207, 211, 216, 218, 222, 224, 228, 231, 236, 242, 243, 246, 249, 254, 256, 259, 264, 265, 271, 272, 280, 283, 287, 288, 289, ...], 'North-West': [0, 4, 7, 11, 16, 17, 21, 29, 30, 34, 36, 38, 39, 42, 43, 44, 46, 48, 49, 52, 55, 56, 62, 66, 70, 71, 74, 79, 88, 89, 90, 91, 95, 98, 99, 103, 106, 116, 117, 119, 122, 123, 128, 129, 132, 137, 143, 144, 147, 148, 151, 153, 154, 156, 160, 161, 169, 171, 175, 178, 184, 185, 186, 198, 204, 206, 209, 212, 217, 221, 223, 225, 230, 233, 234, 235, 237, 240, 244, 251, 252, 253, 255, 260, 261, 263, 266, 267, 277, 278, 281, 285, 290, 291, 296, 297, 300, 318, 320, 321, ...], 'South': [5, 6, 8, 9, 10, 20, 22, 27, 32, 33, 37, 47, 53, 54, 57, 61, 65, 69, 73, 78, 81, 84, 86, 93, 96, 97, 101, 102, 104, 107, 110, 111, 118, 124, 126, 131, 133, 135, 136, 145, 150, 152, 158, 159, 162, 163, 166, 167, 168, 170, 172, 173, 174, 181, 182, 183, 187, 189, 190, 192, 194, 196, 197, 200, 202, 203, 208, 210, 213, 214, 215, 219, 220, 226, 227, 229, 232, 238, 239, 241, 245, 247, 248, 250, 257, 258, 262, 268, 269, 270, 273, 274, 275, 276, 279, 282, 284, 286, 292, 294, ...]}

#### 4) Accessing only Group Names of a GroupBy Object

In [8]:
(data.groupby('region').groups.keys ())

dict_keys(['North-East', 'North-West', 'South'])

#### 5) Selecting a Group of south region

In [64]:
#print(data.groupby('region').get_group('South'))
print(data.groupby('region').get_group('South'))

           date  gender region  sales
5      9/6/2022    Male  South  21792
6     8/21/2022    Male  South  20113
8    11/22/2022    Male  South  14594
9     1/16/2022  Female  South  24114
10   12/21/2022    Male  South  35154
..          ...     ...    ...    ...
972    6/9/2022    Male  South  22254
979  11/24/2022  Female  South  25591
981   12/5/2022    Male  South  34334
985   12/1/2022  Female  South  21282
994   9/29/2022    Male  South  21255

[331 rows x 4 columns]

#### 6) Findout average Sales per region

In [10]:
data.groupby('region')['sales'].mean()

region
North-East    17386.072046
North-West    15257.732919
South         24466.864048
Name: sales, dtype: float64

#### 7) Applying Multiple Aggregations Using Pandas GroupBy - Find out Mean, median and variance of sales per region

In [11]:
data.groupby('region').aggregate([np.mean,np.median,np.var])

C:\Users\ds11\AppData\Local\Temp\ipykernel_18628\117337985.py:1: FutureWarning: ['date', 'gender'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  data.groupby('region').aggregate([np.mean,np.median,np.var])

                   sales
                    mean   median           var
region
North-East  17386.072046  17414.0  4.131225e+06
North-West  15257.732919  15337.5  1.311495e+07
South       24466.864048  24492.0  2.760139e+07

#### 8) Calculate percentage of region's sales per row with respect to total sale of the region

In [31]:
total_sale = data.groupby('region')['sales'].sum()
total_sale
Total = np.sum(data['sales'])
Total
percentage = (total_sale/Total)*100
print('Percentage' , percentage)

Percentage region
North-East    31.678282
North-West    25.797437
South         42.524281
Name: sales, dtype: float64

#### 9) Filtering Rows Where the Group's Average Sale Price is Less Than 20,000

In [66]:
data = data.groupby('region').filter(lambda x: x['sales'].mean() < 20000)
print(data)

           date  gender      region  sales
0     8/22/2022    Male  North-West  20381
1      3/5/2022    Male  North-East  14495
2      2/9/2022    Male  North-East  13510
3     6/22/2022    Male  North-East  15983
4     8/10/2022  Female  North-West  15007
..          ...     ...         ...    ...
995    6/2/2022  Female  North-West  14015
996   5/20/2022  Female  North-East  15503
997    4/2/2022    Male  North-East  18714
998   12/7/2022    Male  North-East  19910
999  12/19/2022  Female  North-West  16589

[669 rows x 4 columns]

#### 10) calculate the sum of all sales broken out by 'region' and by 'gender'

In [68]:
sums = data.groupby(['region', 'gender']).sum()
print(sums.head())

                     sales
region     gender
North-East Female  3051132
           Male    2981835
North-West Female  2455899
           Male    2457091

#### 11) Ranking Sales by Region and by Gender

In [70]:
data['rank'] = data.groupby(['region', 'gender'])['sales'].rank(ascending=False)
print(data)

           date  gender      region  sales   rank
0     8/22/2022    Male  North-West  20381   11.0
1      3/5/2022    Male  North-East  14495  154.0
2      2/9/2022    Male  North-East  13510  168.0
3     6/22/2022    Male  North-East  15983  138.0
4     8/10/2022  Female  North-West  15007   89.5
..          ...     ...         ...    ...    ...
995    6/2/2022  Female  North-West  14015  102.0
996   5/20/2022  Female  North-East  15503  145.0
997    4/2/2022    Male  North-East  18714   48.0
998   12/7/2022    Male  North-East  19910   22.0
999  12/19/2022  Female  North-West  16589   65.0

[669 rows x 5 columns]